{"meta":{"title":"Nina's blog","subtitle":"书写生活、记录成长~","description":null,"author":"大林子","url":"http://yoursite.com"},"pages":[{"title":"更新日志","date":"2018-07-01T16:00:00.000Z","updated":"2018-07-02T15:46:58.016Z","comments":true,"path":"updateLog/index.html","permalink":"http://yoursite.com/updateLog/index.html","excerpt":"","text":""}],"posts":[{"title":"APP版式常见形式","slug":"layOut","date":"2018-09-01T05:27:10.000Z","updated":"2018-09-07T10:02:35.312Z","comments":true,"path":"2018/09/01/layOut/","link":"","permalink":"http://yoursite.com/2018/09/01/layOut/","excerpt":"","text":"信息的有效呈现是非常重要的，所以要有模块的良好布局意识 。 布局的原则 布局要以目的导向为原则来合理的呈现信息。 在做原型前我们布局是为了什么，是否有目的的布局将直接影响产品最终的易用程度是否能真正的满足用户使用，信息的内容是否能有效的传递给用户。 布局形式1. 竖向分栏布局 (1)自上而下区分内容层级，可以引起用户的注意，适用于 首页面 的设计，可以展示丰富的内容，有助于提高浏览和内容分发的效率。可以让需要被曝光的产品第一时间被曝光，区分了重点。 (2)布局目的：追求内容分发效率，例如：资讯类、O2O或视频类。 (3)优点：可以基于算法灵活的设置板块推送的内容，扩展性非常强，适用度广。 (4)缺点：信息过多，容易杂乱。 2. 竖向卡片布局（竖向分割布局） (1)将图片和文字分开，可以使用户聚焦内容，便于引导阅读。卡片可以添加更多内容，提升交互效率。 (2)布局目的：图片+内容组成一个小组，可以聚焦内容，需要用户花大量的时间将注意力聚集在一个小的模块上，营造了浸入式的代入感。 (3)优点：①用户之间、用户和产品方之间的交流友好度很高；②头像、昵称、图文、社交等都可以承载，有助于提高用户粘性。 (4)缺点：一屏展示内容少，信息量降低。 (5)怎样支持社交：将社交功能直接排列在内容的低端，很整齐，视觉上很舒服。对于整个卡片的阅读毫无干扰，既不会分散用户的注意力，也不会造成使用的不便利。 3. 列表布局 (1)简明展示了内容，便于集中浏览，突出效率。经常最为“设置”页面和信息流页面的布局。除了像微信那样的即时通信类工具，将列表式布局用作首页面布局方式。 (2)布局目的：提高信息浏览、处理效率。 (3)优点：很多时候可以作为导航，提高信息处理效率。 (4)缺点：通常以文字为主，形式较为呆板，视觉冲击力弱。 4. 左右分割布局 (1)优点：兼顾竖幅和横幅图片的展示效果，排版更活泼，多以瀑布流形式展示 (2)缺点：信息层级不明显，不易区分主次。 5. 宫格式布局 (1)优点：整体感强，适合产列内容。 (2)适用场景：对视频类产品支持较好，可以一次性展示很多内容，排列很规矩。 (3)缺点：信息层级不明显，不易区分主次。在首页使用时缺乏气势。 6. 满版式布局 (1)图片可以充满整个页面，视觉效果值观而强烈。 (2)适用场景：作为启动页，突出品牌，做产品的推广和传递； (3)缺点：偏视觉展示，实用性较低。 小小总结&emsp;&emsp;每一款产品，都有他自己的气质。在选取怎样的布局方式时，要先明确产品是怎样的类型，产品的每一个页面承载这怎样的功能，进而选择布局方式，这样才能有布局的意义。","categories":[{"name":"产品开发","slug":"产品开发","permalink":"http://yoursite.com/categories/产品开发/"}],"tags":[{"name":"交互设计","slug":"交互设计","permalink":"http://yoursite.com/tags/交互设计/"}]},{"title":"前端监控和前端埋点方案设计【转载】","slug":"wayOfUser","date":"2018-09-01T03:56:54.000Z","updated":"2018-09-05T06:12:32.208Z","comments":true,"path":"2018/09/01/wayOfUser/","link":"","permalink":"http://yoursite.com/2018/09/01/wayOfUser/","excerpt":"","text":"原文地址：https://github.com/forthealllight/blog/issues/23在线上项目中，需要统计产品中用户行为和使用情况，从而可以从用户和产品的角度去了解用户群体，从而升级和迭代产品，使其更加贴近用户。用户行为数据可以通过前端数据监控的方式获得，除此之外，前端还需要实现性能监控和异常监控。性能监控包括首屏加载时间、白屏时间、http请求时间和http响应时间。异常监控包括前端脚本执行报错等。 实现前端监控有三个步骤：前端埋点和上报、数据处理和数据分析。本文针对整个前端监控，设计适用的方案。本文的主要内容分为： 为什么需要前端监控 常用前端埋点方案总结 前端埋点方案选型和前端上报方案设计 前端监控结果可视化展示系统的设计 一、为什么需要前端监控前端监控的目的是：获取用户行为以及跟踪产品在用户端的使用情况，并以监控数据为基础，指明产品优化的方向。 前端监控可以分为三类：数据监控、性能监控和异常监控。下面我们来一一的了解。 (1)数据监控数据监控，顾名思义就是监听用户的行为。常见的数据监控包括： PV/UV:PV(page view)，即页面浏览量或点击量。UV:指访问某个站点或点击某条新闻的不同 用户在每一个页面的停留时间 用户通过什么入口来访问该网页 用户在相应的页面中触发的行为 统计这些数据是有意义的，比如我们知道了用户来源的渠道，可以促进产品的推广，知道用户在每一个页面停留的时间，可以针对停留较长的页面，增加广告推送等等。 (2)性能监控性能监控指的是监听前端的性能，主要包括监听网页或者说产品在用户端的体验。常见的性能监控数据包括： 不同用户，不同机型和不同系统下的首屏加载时间 白屏时间 http等请求的响应时间 静态资源整体下载时间 页面渲染时间 页面交互动画完成时间 这些性能监控的结果，可以展示前端性能的好坏，根据性能监测的结果可以进一步的去优化前端性能，比如兼容低版本浏览器的动画效果，加快首屏加载等等。 (3)异常监控此外，产品的前端代码在执行过程中也会发生异常，因此需要引入异常监控。及时的上报异常情况，可以避免线上故障的发上。虽然大部分异常可以通过try catch的方式捕获，但是比如内存泄漏以及其他偶现的异常难以捕获。常见的需要监控的异常包括： Javascript的异常监控 样式丢失的异常监控 二、常用前端埋点方案总结在上一节中介绍了前端监控的作用，那么如何实现前端监控呢，实现前端监控的步骤为：前端埋点和上报、数据处理和数据分析。首要的步骤就是前端埋点和上报，也就是数据的收集阶段。数据收集的丰富性和准确性会影响对产品线上效果的判别结果。 目前常见的前端埋点方法分为三种：代码埋点、可视化埋点和无痕埋点。下面一一介绍每一种埋点的方法。 (1) 代码埋点代码埋点，就是以嵌入代码的形式进行埋点，比如需要监控用户的点击事件，会选择在用户点击时，插入一段代码，保存这个监听行为或者直接将监听行为以某一种数据格式直接传递给server端。此外比如需要统计产品的PV和UV的时候，需要在网页的初始化时，发送用户的访问信息等。 代码埋点的优点： 可以在任意时刻，精确的发送或保存所需要的数据信息。 缺点： 工作量较大，每一个组件的埋点都需要添加相应的代码 (2)可视化埋点通过可视化交互的手段，代替代码埋点。将业务代码和埋点代码分离，提供一个可视化交互的页面，输入为业务代码，通过这个可视化系统，可以在业务代码中自定义的增加埋点事件等等，最后输出的代码耦合了业务代码和埋点代码。 可视化埋点听起来比较高大上，实际上跟代码埋点还是区别不大。也就是用一个系统来实现手动插入代码埋点的过程。 缺点： 可视化埋点可以埋点的控件有限，不能手动定制。 (3)无埋点无埋点并不是说不需要埋点，而是全部埋点，前端的任意一个事件都被绑定一个标识，所有的事件都别记录下来。通过定期上传记录文件，配合文件解析，解析出来我们想要的数据，并生成可视化报告供专业人员分析因此实现“无埋点”统计。 从语言层面实现无埋点也很简单，比如从页面的js代码中，找出dom上被绑定的事件，然后进行全埋点。 无埋点的优点： 由于采集的是全量数据，所以产品迭代过程中是不需要关注埋点逻辑的，也不会出现漏埋、误埋等现象 缺点： 无埋点采集全量数据，给数据传输和服务器增加压力 无法灵活的定制各个事件所需要上传的数据 三、前端埋点方案选型和前端上报方案设计第一章中介绍了前端所需要监听的信息，在第二章中介绍了前端埋点的常见方式，本文来根据需求，来定制我们的埋点和上报方案。 (1)监控数据首先我们需要明确一个产品或者网页，普遍需要监控和上报的数据。监控的分为三个阶段：用户进入网页首页、用户在网页内部交互和交互中报错。每一个阶段需要监控和上报的数据如下图所示： (2)埋点方案在实际项目中考虑到上报数据的灵活定制，以及减少数据传输和服务器的压力，在所需埋点处不多的情况下，常用的方式是代码埋点。 以用户进入首页为例，我们在首页渲染完成后会发送事件类型和类型相关的数据给server端，告知首页的监控信息。 (3)上报周期和上报数据类型如果埋点的事件不是很多，上报可以时时进行，比如监控用户的交互事件，可以在用户触发事件后，立刻上报用户所触发的事件类型。如果埋点的事件较多，或者说网页内部交互频繁，可以通过本地存储的方式先缓存上报信息，然后定期上报。 接着来确定需要埋点上报的数据，上报的信息包括用户个人信息以及用户行为，主要数据可以分为： who: appid(系统或者应用的id),userAgent(用户的系统、网络等信息) when: timestamp(上报的时间戳) from where: currentUrl(用户当前url)，fromUrl(从哪一个页面跳转到当前页面)，type(上报的事件类型),element(触发上报事件的元素） what: 上报的自定义扩展数据data:{},扩展数据中可以按需求定制，比如包含uid等信息 上报数据的对象为：12345678910111213141516171819 &#123; ----------------上报接口本身提供-------------------- currentUrl, fromUrl, timestamp, userAgent:&#123; os, netWord, &#125; ----------------业务代码配置和自定义上报数据------------ type, appid, element, data:&#123; uid, uname &#125; &#125;``` (4)埋点和上报举例我们以上报首屏加载事件为例，DOM提供了document的DOMContentLoaded事件来监听dom挂载，提供了window的load事件来监听页面所有资源加载渲染完毕。 123456789101112131415161718192021&lt;script type=&quot;text/javascript&quot;&gt; var start=Date.now(); document.addEventListener( &apos;DOMContentLoaded&apos;, function() &#123; fetch(&apos;some api&apos;,&#123; type:&apos;dom complete&apos;, data:&#123; domCompletedTime:Date.now()-start &#125; &#125;) &#125;); window.addEventListener(&apos;load&apos;, function() &#123; fetch(&apos;some api&apos;,&#123; type:&apos;load complete&apos;, data:&#123; LoadCompletedTime:Date.now()-start &#125; &#125;) &#125;);&lt;/script&gt; (5)前端埋点系统的前后端通信加密在上报数据的前后端通信中，需要和server端协商加密机制，利用 OpenSSL库来实现的加密，OpenSSL已经是一个广泛被采用的加密算法。前端可以采用node的crypto模块。 首先来看hash算法，crypto.createHash() 来创建一个Hash实例，可利用的hash算法如下： md5 sha1 sha256 sha512 ripemd160 以sha256算法加密为例： 1234const str=&quot;123445&quot;; //需要加密的字段const hash=crypto.createHash(&apos;sha256&apos;); //指定加密算法hash.update(str); //通过算法加密相应的字段const result=hash.digest(&apos;hex&apos;); //转化成十六进制 四、前端监控结果可视化展示系统的设计当后端得到前端上报的信息之后，经过数据分析和处理，需要前端可视化的展示数据分析后的结果。 可以在开源中后台系统ant-design-pro的基础上进行二次开发，首先要明确展示信息。展示的信息包括单个用户和整体应用。 对于单个用户来说需要展示的监控信息为： 单个用户，在交互过程中触发各个埋点事件的次数 单个用户，在某个时间周期内，访问本网页的入口来源 单个用户，在每一个子页面的停留时间 对于全体用户需要展示的信息为： 某一个时间段内网页的PV和UV 全体用户访问网页的设备和操作系统分析 某一个时间段内访问本网页的入口来源分析 全体用户在访问本网页时，在交互过程中触发各个埋点事件的总次数 全体用户在访问本网页时，网页上报异常的集合 删选功能集合： 时间筛选：提供今日（00点到当前时间）、本周、本月和全年 用户删选：提供根据用户id删选出用户行为的统计信息 设备删选：删选不同系统的整体展示信息","categories":[{"name":"前端开发","slug":"前端开发","permalink":"http://yoursite.com/categories/前端开发/"}],"tags":[{"name":"埋点设计","slug":"埋点设计","permalink":"http://yoursite.com/tags/埋点设计/"}]},{"title":"电商模式相关数据","slug":"dateAnalysis","date":"2018-07-08T02:54:28.000Z","updated":"2018-09-10T01:53:21.034Z","comments":true,"path":"2018/07/08/dateAnalysis/","link":"","permalink":"http://yoursite.com/2018/07/08/dateAnalysis/","excerpt":"","text":"电商模式1. 模式分类 用户获取模式 年复购率不足35%~40%，季复购率1~15%之间，重心应该放在获取新用户上，培养用户忠诚度并不能获取长期收益。产品和用户没有黏性，应该加大投放力度（如投放广告），让更多的新用户来使用，即拉新为主，如瓜子二手车、公众号打赏等。 混合模式 年复购率35%~65%，季复购率15~35%之间，重心应当兼顾新用户获取和老用户维护，同时设法刺激用户的购买频率。例如，鞋子，鞋子不属于高频购买的东西，所以既要拉新，又要提供售后和服务。 忠诚度模式 年复购率60%以上，季复购率30%以上，应该将经营重心放在用户忠诚度上，鼓励忠诚用户频繁消费。例如，老凤翔、周生生、施华洛等品牌，用户非常认可。 2. 相关指标 转化率 访客中发生购买行为的比例，电商健康程度的基本指标之一。电商刚起步，转化率比营业额更重要。 单位时间购买频次 有拉新模式、混合模式、忠诚度模式。协同转化率共同验证用户和网站的关系。 购物车大小 不但要知道用户买了多少产品，还要知道他们花了多少钱。可以验证营销效果，判断高价值用户，预估利润。 弃买率 1-转化率，弃买率是衡量转化漏斗的工作重心，找到转化瓶颈，制定当下工作的主要内容。 获客成本 产品的主要成本投入 平均每位客户营收 包含了购物车大小，弃买率和转化率的综合指标。 关键词和搜索词 大部分人都是通过搜索来寻找产品，必须知道最有好处的关键词有哪些。对于收费搜索渠道，不可避免的陷入竞价排名，性价比是关键。对于免费搜索渠道，重点是要创作出更优质、吸引人且可以引流的内容上。调整内部搜索，将高频、高曝光需求内容及高优先级，提升效率。 推荐搜索度 对机器学习要求很高，猜用户喜欢的东西，并推荐给用户。 病毒性 非常重要，口碑传播、病毒式传播可以用较低的成本换来高价流量。 线上线下结合 高额的运费会降低转化率，送货及时性是用户满意度和重复购买率的重要因素。 送达时间 实时送达及次日达越来越普遍。通过优化订单处理和送货流程，可以显著的提高整体的运营效率。 库存情况 针对库存情况制定专门的方案。 3. 小小总结明确是忠诚度模式还是用户获取模式和重要，它关系着营销和网店的向导。 转化率、重复购买率及购物车大小很重要，他们影响着平均每位用户营收。 送货、库房、物流和库存也是很重要的问题。","categories":[{"name":"产品开发","slug":"产品开发","permalink":"http://yoursite.com/categories/产品开发/"}],"tags":[{"name":"数据分析","slug":"数据分析","permalink":"http://yoursite.com/tags/数据分析/"}]},{"title":"漏斗模型","slug":"funnel","date":"2018-05-13T03:43:44.000Z","updated":"2018-09-10T01:52:43.371Z","comments":true,"path":"2018/05/13/funnel/","link":"","permalink":"http://yoursite.com/2018/05/13/funnel/","excerpt":"","text":"漏斗模型的内容 Acquisition(获取用户)：用户怎样知道你的存在？ Activation(激活用户)：路过的人是否会进行操作？ Retention(留存)：初次使用后是否还会重复使用？ Revenue(收入)：是否能从对方的行为和动机中盈利？ Referral(传播)：用户是否会帮助你进行产品的推广？ 举个🍐：我开了一家花店，当路过的人看到我的花店，就是一次获取；但只有当这个路人进入了花店，才能算是用户被激活；某顾客来了一次以后，又来了一次或多次，这是留存；有顾客购买了我的鲜花，我就有了收入；如果现有的过客向其他人推荐了我的花店，那么就完成了传播。 漏斗模型不同阶段要提升的数据 获取用户 &emsp;要做什么：用所有的方式吸引用户的注意，无论是免费还是付费的方式。 &emsp;相关的指标：流量、搜索量、获客成本、点击率等。 提高活跃度 &emsp;要做什么：将游客转化为真正的用户。 &emsp;相关的指标：注册人数、注册量、新手流程完成度、首次完整使用量、订阅量等。 提高留存率 &emsp;要做什么：让用户再次光临，反复使用，产生粘性。 &emsp;相关的指标：用户的参与度、上次登陆时间、日/月活跃度、流失率等。 获取营收 &emsp;要做什么：各种商业产品（购买、广告点击、内容产生量、订阅量等）。 &emsp;相关的指标：用户终生价值（用户从来到走的消费总额）、付费转化率、平均购物车大小、广告点击营收等等。 用户传播 &emsp;要做什么：已存在用户的口碑宣传。 &emsp;相关的指标：分享率、病毒传播系数、转发量等。 漏斗模型作用 通过漏斗分析还原用户行为路径。 需要关注哪一步流失用户数最多？流失的都是谁及流失这都有哪些行为？ 明确产品目标，根据漏斗模型分析优化产品。","categories":[{"name":"产品开发","slug":"产品开发","permalink":"http://yoursite.com/categories/产品开发/"}],"tags":[{"name":"数据分析","slug":"数据分析","permalink":"http://yoursite.com/tags/数据分析/"},{"name":"漏斗模型","slug":"漏斗模型","permalink":"http://yoursite.com/tags/漏斗模型/"}]},{"title":"竞品分析","slug":"compete","date":"2018-04-01T05:21:02.000Z","updated":"2018-09-10T01:51:12.874Z","comments":true,"path":"2018/04/01/compete/","link":"","permalink":"http://yoursite.com/2018/04/01/compete/","excerpt":"","text":"竞品分析的目标 深化了解，全面了解竞争。 采集需求，可以加速产品成型。 完善产品的服务，人有我优。 优化产品体验，人无我有。 什么时候进行竞品分析？ 初级产品定位前 通过竞品分析来采集需求 产品定位后 深入了解竞品的情况。到底他们是怎样的产品，他们的功能是怎样设置的，流程是怎样做的，设计是怎样做的，元素是怎样安排的。 产品上线后 关注竞品更新，看竞品公司是否有技术、运营、营销的变化。 竞品分析内容在分析时，不用每次都全面的分析。明确目标后针对目标内容分析即可 确定目标。目标是前提，要明确分析的目的是什么，是针对什么事情进行竞品分析的。 确定竞品是谁。是直接竞品(与我们功能一致的产品)还是间接竞品(单项排他产品)。通常要和直接竞品进行比较，和间接竞品学习。 确定分析维度。具体问题具体分析，可以是综合类、运营类、产品类。 输出必要的文档。 (1) 交互方式：产品原型、交互文档、产品界面交互方式 (2) 信息架构：功能架构、信息组织架构 (3) 产品定位：收集版本信息(下载量和评价等) (4) 盈利模式：产品运营模式、内容运营模式 (5) 用户情况、行业发展 竞品分析——功能点分析 比较路径 从软件进入后看到功能入口，点击功能入口后功能跳转 要考虑竞品的用户+场景，然后再结合自身的用户+场景 看功能 相似的功能，不同的产品完善的方式可能不同。 结合自身产品的渠道资源等，思考提供给用户的功能会让用户又怎样的体验。 拼长相 关注不同竞品的展示形式 SWOT分析S——Strangths：优势； W——Weaknesses：劣势； O——Opportunities：机遇； T——Threats：威胁； 在经过竞品分析后，我们可以知道我们自己的优势和劣势。然后我们可以将我们的优势、劣势、所面临的机遇和挑战以四象限的方式列出。 通过 优势+机遇(SO)、优势+威胁(ST)、劣势+机遇(WO) 的组合分析，得到我们对产的优化、规避风险等一些结论，使得我们对自己的产品有更好的认识。","categories":[{"name":"产品开发","slug":"产品开发","permalink":"http://yoursite.com/categories/产品开发/"}],"tags":[{"name":"竞品分析","slug":"竞品分析","permalink":"http://yoursite.com/tags/竞品分析/"}]},{"title":"怎样明确我们的用户","slug":"userResearch","date":"2018-03-18T05:21:02.000Z","updated":"2018-09-10T01:50:55.146Z","comments":true,"path":"2018/03/18/userResearch/","link":"","permalink":"http://yoursite.com/2018/03/18/userResearch/","excerpt":"","text":"用户是产品的直接使用者。了解用户群体的构成、对用户进行细分有助于我们进行竞品分析和产品迭代升级。 为什么要用户细分？ 企业的资源是有限的，不可能为所有人服务，只能先服务一部分人。 不同的用户群体，他们的需求可能是相互冲突的。如果盲目的产品升级，一些用户的服务做好了，可能导致另一些用户被挤掉。如果被挤掉的用户是主流用户，那么将得不偿失。所以要抓住主流用户，首先为他们服务。 市场竞争的本质是用户竞争，我们应该在对于我们有利的领域争夺用户，而不是在机会极小的领域。 用户细分的角度 数据的角度：提出直接相关的数据指标进行分析，从而将用户进行细分。 用户属性：性别、年龄、收入、婚姻状况、爱好、学历、交际圈等。 关键指标：活跃度（因公司而异，通常是用户在连续登陆多少天，并且干了什么），购买率等。 用户的行为：分析活跃和不活跃的原因，并把这些原因进行比较，引导不活跃用户干活跃用户干的事情，进而转化为活跃用户。 使用的角度： 专家级别：如产品经理 熟练级别：如程序员、设计师、测试人员等 主流用户：如行政人员、HR等 用户场景合理的分析场景有助于更好地实现用户目标和产品功能。 了解场景的目的 有助于我们制定功能，优化体验，支持运营 基础场景 (1) 外环境：既是产品作用的时间，也是用户的聚集地。它回答了“产品在什么时间，什么地方，在什么网络下，什么设备上常用来干什么”的问题。外环境对每个产品而言是比较公平的。 ① 时间：如早、中、晚；春、夏、秋、冬；运动时、睡觉前、吃饭时等。 ② 环境：使用场所、网络环境（4G/WIFI/强/弱）。 (2) 内环境 人：年龄、性别、收入、学历；心理预期；操作流程等。 深入的了解用户和产品的交互，可以合理地进行场景化设计。 前期：产品在设计初期，主要的工作是了解用户的目标。 中期：用户在使用产品的过程中，要节能高效。 后期：用户在使用产品（或功能）后，要考虑用户的下一步可能有的行为 需求场景入口分类 好的产品满足的需求应该是是广覆盖的，全方位的。一个产品一开始可以从满足某一个需求场景入口进入，但在后期的产品规划中，可以逐渐覆盖所有的需求点。 用户场景挖掘 首先假设用户场景，然后进行观察和研究，最后进行场景的穷尽列举。 用户画像用户画像本质就是给用户/用户群打标签 用户画像分类 显性画像：统计学的描述。如：年龄、性别、职业、地域等。 隐性画像：情感、目标及场景。如：使用的目的、用户的偏好、使用场景等。 用户画像作用 事前比对用户与业务，从而预测一下用户是不是你预测的用户 事中验证用户与业务。即如果按照画像进行产品的设计后，结果发现用户不喜欢，就要分析哪里出现了问题，并及时进行纠正。","categories":[{"name":"产品开发","slug":"产品开发","permalink":"http://yoursite.com/categories/产品开发/"}],"tags":[{"name":"用户体验","slug":"用户体验","permalink":"http://yoursite.com/tags/用户体验/"}]},{"title":"开始一个新产品，我们需要做什么？","slug":"productEntry","date":"2018-01-25T09:37:10.000Z","updated":"2018-09-10T01:48:55.325Z","comments":true,"path":"2018/01/25/productEntry/","link":"","permalink":"http://yoursite.com/2018/01/25/productEntry/","excerpt":"","text":"从目标开始1. 制定目标的前提要做一款产品，重要的不是想要做一款什么样的产品，而是我们能做一款怎样的产品。所以在研发一款产品前，我们需要先了解我们拥有哪些能力： 资格 企业拥有哪些牌照。拥有这些牌照后，企业就可以从事哪些业务；是否有国家政策的支持等。这些都是我们的资格。只有先拥有资格，才能从事在这种资格下的业务。 渠道 我们可以通过哪些渠道来获取我们的用户。让用户主动来找我们：SEO、社交媒体、论坛贴吧、网络课堂等我们主动让别人来看：SEM、互联网广告、网络营销、传统或网络媒体 2. 规划产品的流程(1) 删除：删去冗余的流程 (2) 组织：合并并梳理流程 (3) 转移：多方均摊流程 3. 考虑产品在不同阶段的方向(1) 产品初期：要抢占市场 对于实力强大的公司，他们有很大的用户量，所以他们可以采用开放平台的形式； 可以利用流量很高的入口，如内容引流（网剧、主播等）、游戏、小视频等； 借助其他热点信息和文化导向、新的政策方向、新的技术革命 (2) 产品中期： 发展自身的功能优势和技术优势 (3) 产品成熟期： 可以考虑衍生出长期发展的产品 企业目标1. 用户与企业的关系用户需求：用户通过产品能得到什么 企业目标：公司通过产品能得到什么 2.企业目标的相关内容(1) 商业愿景：希望产品以后会有一个怎样的发展，可以很概念，也可以很具体。 (2) 商业模式：目标用户+产品的差异化+核心资源+成本结构 (3) 品牌识别：当用户需要解决什么问题时，第一时间就可以想到我们的产品 (4) 产品价值：产品是相关劳动和决策（如：用户研、决策管理、市场环境、设计体验、运营运维）的综合。而产品最终可以产生经济价值、企业价值、社会价值等。 一个idea的产生1. 新机会带来idea产生的时机(1) 情景的转变： 新的政治经济政策的变化，如“一带一路”、《中国制造2025》、二胎政策等 新模式新需求产生时，如互联网+。 老项目衰落，但是可以转型，如睡眠灯的出现。 (2) 科技的升级 新技术发展时，如VR、AR技术的发展，被用到很多地方（手术模拟、倒车镜等） 新方法产生时。 (3) 垂直领域的挖掘 标准化服务完善统一时，要考考虑垂直领域。着眼于少有但总量却很大的需求，比如养殖宠物守宫的用户。 2. 从怎样的角度来思考一个idea(1) 用新产生的事物来代替原有的事物，如用语音、图片搜索来代替文字搜索 (2) 将多个事物组合在一起，探探的颜值社交 (3) 从常规的解决方法的反向方法来解决问题，如微信、QQ是双向社交，微博是单项社交。","categories":[{"name":"产品开发","slug":"产品开发","permalink":"http://yoursite.com/categories/产品开发/"}],"tags":[{"name":"产品立项","slug":"产品立项","permalink":"http://yoursite.com/tags/产品立项/"}]},{"title":"关于闭包的浅显理解","slug":"closure","date":"2018-01-11T04:07:41.000Z","updated":"2018-09-10T01:56:17.572Z","comments":true,"path":"2018/01/11/closure/","link":"","permalink":"http://yoursite.com/2018/01/11/closure/","excerpt":"","text":"closure","categories":[{"name":"前端开发","slug":"前端开发","permalink":"http://yoursite.com/categories/前端开发/"}],"tags":[{"name":"闭包","slug":"闭包","permalink":"http://yoursite.com/tags/闭包/"}]},{"title":"搜索方式的\"小心机\"","slug":"Search","date":"2017-11-02T14:33:51.000Z","updated":"2018-09-10T01:48:31.905Z","comments":true,"path":"2017/11/02/Search/","link":"","permalink":"http://yoursite.com/2017/11/02/Search/","excerpt":"","text":"不同功能，不同需求的界面会影响到搜索框入口的设计 搜索框的类型1. 系统层级的搜索框由于权重过高，关乎第三方入口的提供，所以基于它的重要程度，ios以输入框的形式将其放置在下拉菜单的顶部 2. 单纯的Icon放大镜作为搜索入口：特点：小Icon需要多次点击，点击后才会出现一个搜索状态。操作较为繁琐。 使用场景： 类似于基于用户兴趣推送一些内容（也就是产品方希望用户看到自己给用户推送的内容），如果将搜索框作为搜索入口，则搜索将会更便利，导致用户自主去查找一些内容，那么浏览器推送内容的频率就会下降，进而无法很好的达成产品目标。其根本的目标是：让用户多看推荐，少进行搜索操作。并且icon可以减弱搜索的存在感。 3. 搜索框作为搜索入口特点：只需要一次点击，就可以搜索，存在感强，操作简洁。 使用场景： (1) “任务型”用户：目标特别明确。对于目标感强烈的用户，如果搜索入口不明显，会带来不好的体验。用搜索框作为搜索入口，便于这类用户第一时间解决问题，如电商类产品； (2)对于那些不知到接下来做得什么的用户，可以直接用搜索达到想去的页面（如电商的搜索建议）； (3) 搜索引擎类产品，其主营业务就是搜索，所以自然希望用户获取的信息都是通过搜索获得，所以搜索是他们的唯一入口。 搜索框的交互设计1. 自动补全：帮助优化用户搜索条件；降低输入错误；帮助运营2. 历史记录：搜索引擎入口代替其他入口，与自动匹配配合使用3. 自动纠错：当用户在搜索一些信息，不确定搜索的关键词时哪个词时，有自动纠错功能，可以减少用户输入错误或本身记忆引起的问题，从而提高用户对产品的好感度。4. 高亮显示：帮助用户再一次确定关键词是否正确（例如，用户搜索生僻词时），帮助用户纠错。5. 联想推荐：(1) 当用户反复搜索某关键词时，场景：如某东西只是听说过，但并不知道具体是什么，联想推荐可以不断缩小搜索的范围； (2) 一种是扩展推荐，因为用户搜索的不够具体，会推荐该搜索词更细的分类； (3) 移动端屏幕资源会比较紧张，一般不会直接列出来联想推荐。但也有其他方案，比如用户有一定的浏览深度的时候进行联想推荐（如淘宝中，浏览某商品次数超过阈值时，就会有联想推荐，但不会始终展示） 6. 命中词定制：(1) 在结果命中一些关键词之后，展示区别与一般的搜索结果列表不同，尤其是对于顶部进行一些设计。（如，当有一些商业合作时，可以做一些推广，尤其是一些合作伙伴）。 (2) 在移动端，如在电商产品中搜索某个品牌，就会在顶部出现这个品牌的logo+推广产品。 7. 自主排序：提炼用户所关心的维度，基于这些维度进行排序，对用户筛选物品的效率有所提高，如电商产品的“按销量”排序8. 筛选器：筛选条件比较多、内容很复杂时，帮助用户快速筛选","categories":[{"name":"产品开发","slug":"产品开发","permalink":"http://yoursite.com/categories/产品开发/"}],"tags":[{"name":"交互设计","slug":"交互设计","permalink":"http://yoursite.com/tags/交互设计/"}]},{"title":"注册登陆小结","slug":"login","date":"2017-10-22T14:09:23.000Z","updated":"2018-09-10T01:55:19.298Z","comments":true,"path":"2017/10/22/login/","link":"","permalink":"http://yoursite.com/2017/10/22/login/","excerpt":"","text":"产品的注册登陆是很重要的，因为它关乎到产品获取第一批用户。 用户登陆注册系统分类1. 用户自建系统产品自己有一个用户系统数据库，数据库中的数据都是产品私有的，是产品方真正想要的。只有真正的获取到了用户系统数据之后，才能更有针对性的做一些推送。例如做一些针对性的大数据分析、大数据应用、AI学习。 2. 第三方账号授权用户系统用户都是别人的（如：支付宝、微信、微博等）。此时的用户信息只是借用，无法真正获取用户的信息。 一些具体的注册方式1. 用户名+密码优点：不涉及手机号等隐私性必要强的信息，有利于产品的初级传播 实例：对于一些小众产品，不需要自己的用户数据库，需要的是获取流量。此时可以使用用户名+密码的登陆方式 2. 手机号+验证码优点：手机号注册及实现了注册本身功能的需求，同时又可以进行身份的验证，并且不需要记住密码 实例：电商和O2O产品 3. 手机号+密码优点：没有手机必须在身边的限制，受众人群比较广 缺点：安全性比较低 4. 邮箱+密码优点： (1) 邮箱+密码是一种很古老的形式，这种登陆方式可以兼顾到老用户。 (2) 邮件的查看频率不是很高，可以丰富分发内容的手段 缺点：在移动端验证邮箱很麻烦，需要跳出产品到邮箱中点击连接，点击链接后还要跳到一个新的页面。重点是，在这个过程中用户离开了产品。用户频繁的跳出产品，容易造成用户流失。 5. 第三方账号登陆优点： (1) 第三方产品有超大的用户量，如QQ、微信、微博等。所以产品使用第三方登陆，可以在很短的时间内获得很大的用户量。 (2) 不用自己验证，第三方帮助验证。 缺点：虽然可以获得很大的用户量，但却不是用户数据，不是真实的用户信息。 5. 人脸识别、指纹优点：可以作为手机、邮箱等主流注册方式的辅助，来提高注册登陆的安全性（如支付宝） 缺点：如果作为单一的注册方式，则没有任何的推广方式 手机号注册小贴士手机号是一个稳定的身份id，用户对手机号的依赖性很强，并且还可以帮助产品展开更多的服务（如，访问通讯录）。 然而手机号对与用户来讲是一种隐私，对于一款小众产品一开始就使用手机号作为注册方式，可能会遭到用户本能的抵制。 用户注册的时机使用产品前先注册的方式是简单粗暴的。在产品不具备一定的规模前，采用先注册后使用的方式不利于用户的增长，应该先培养用户的使用习惯。 所以可以先开放部分功能供用户使用，当用户使用到核心功能时再跳转到注册页，如： (1) 商品结算时（如：电商类产品、游戏类产品）； (2) 评论、点赞、收藏时（如，不注册就无法进行评论、点赞、收藏）； (3) 查看更多评论、内容时（如，社交类产品、知识付费类产品）； (4) 查看其他用户个人主页时； 用户注册登陆的一些交互细节 在移动端，使用手机号注册是最便捷的方式 在填写信息时，完成一步，在出现下一步，不要将所有的任务都放在一个页面中。任务量过大，会给用户造成压力，还会增大断网导致已填写信息丢失的风险。 可以先对用户当前填写的输入域进行验证，如果有错误要及时反馈并提醒用户（如，“用户名已存在”，“密码不符合规定格式”等）。然后再让用户继续填写。 安全的移动端可以设置密码可见的功能，方便用户进行纠错。 在安全的登陆设备上，可以有是否“记住密码”的选项。记住密码后，历史登陆用户可以避免每次登陆时都要进行“用户名”、“密码”等输入步骤，减轻用户负担。","categories":[{"name":"产品开发","slug":"产品开发","permalink":"http://yoursite.com/categories/产品开发/"}],"tags":[{"name":"交互设计","slug":"交互设计","permalink":"http://yoursite.com/tags/交互设计/"}]},{"title":"看电影之《绿里奇迹》","slug":"move01","date":"2017-09-02T03:56:54.000Z","updated":"2018-09-10T01:54:30.889Z","comments":true,"path":"2017/09/02/move01/","link":"","permalink":"http://yoursite.com/2017/09/02/move01/","excerpt":"","text":"","categories":[{"name":"爱生活","slug":"爱生活","permalink":"http://yoursite.com/categories/爱生活/"}],"tags":[{"name":"影评","slug":"影评","permalink":"http://yoursite.com/tags/影评/"}]},{"title":"看电影之《当幸福来敲门》","slug":"movie02","date":"2017-05-01T04:41:31.000Z","updated":"2018-09-10T01:55:45.209Z","comments":true,"path":"2017/05/01/movie02/","link":"","permalink":"http://yoursite.com/2017/05/01/movie02/","excerpt":"","text":"","categories":[{"name":"爱生活","slug":"爱生活","permalink":"http://yoursite.com/categories/爱生活/"}],"tags":[{"name":"影评","slug":"影评","permalink":"http://yoursite.com/tags/影评/"}]}]}